particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
private:
    struct CachedDevice {
        CachedDevice* next;
        hal_ble_addr_t addr;
    };

    struct PendingResult {
        PendingResult* next;
        hal_ble_gap_on_scan_result_evt_t resultEvt;
    };

    bool isCachedDevice(const hal_ble_addr_t& address) const;
    int addCachedDevice(const hal_ble_addr_t& address);
    void clearCachedDevice();
    hal_ble_gap_on_scan_result_evt_t* getPendingResult(const hal_ble_addr_t& address);
    int addPendingResult(const hal_ble_gap_on_scan_result_evt_t& resultEvt);
    void removePendingResult(const hal_ble_addr_t& address);
    void clearPendingResult();
    int continueScanning();
    static void observerEventProcessedHook(const hal_ble_evts_t *event, void* context);
    static void processObserverEvents(const ble_evt_t* event, void* context);

    bool observerInitialized_;
    volatile bool isScanning_;                              /**< If it is scanning or not. */
    hal_ble_scan_params_t scanParams_;                      /**< BLE scanning parameters. */
    os_semaphore_t scanSemaphore_;                          /**< Semaphore to wait until the scan procedure completed. */
    uint8_t scanReportBuff_[BLE_MAX_SCAN_REPORT_BUF_LEN];   /**< Buffer to hold the scanned report data. */
    ble_data_t bleScanData_;                                /**< BLE scanned data. */
    AtomicAllocedPool observerScannedDataPool_;             /**< Pool to allocate memory for scanned data. */
    bool scannedDataPoolInit_;
    hal_ble_on_scan_result_cb_t scanResultCallBack_;        /**< Callback function on scan result. */
    void* context_;                                         /**< Context of the scan result callback function. */
    AtomicIntrusiveList<CachedDevice> cachedDevicesList_;   /**< Cached address of scanned devices to filter-out duplicated result. */
    AtomicIntrusiveList<PendingResult> pendingResultsList_; /**< Caches the scanned advertising data until the scan response data is captured. */
    AtomicAllocedPool scanCacheDevicesPool_;
    bool scanCacheDevicesPoolInit_;
    AtomicAllocedPool scanPendingResultsPool_;
    bool scanPendingResultsPoolInit_;
};

class BleObject::ConnectionsManager {
public:
    struct BleConnection {
        BleConnection* next;
        hal_ble_role_t role;
        hal_ble_conn_handle_t connHandle;
        hal_ble_conn_params_t effectiveConnParams;
        hal_ble_addr_t peer;
        /*
         * A device's Exchange MTU Request shall contain the same MTU as the
         * device's Exchange MTU Response (i.e. the MTU shall be symmetric).
         */
        size_t effectiveMtu;
        bool isMtuExchanged;
    };

    ConnectionsManager()
            : connMgrInitialized_(false),
              isConnecting_(false),
              disconnectingHandle_(BLE_INVALID_CONN_HANDLE),
              centralConnParamUpdateHandle_(BLE_INVALID_CONN_HANDLE),
              periphConnParamUpdateHandle_(BLE_INVALID_CONN_HANDLE),
              connParamsUpdateAttempts_(0),
              connParamsUpdateTimer_(nullptr),
              connParamsUpdateSemaphore_(nullptr),
              connectSemaphore_(nullptr),
              disconnectSemaphore_(nullptr),
              attMtuExchangeConnHandle_(BLE_INVALID_CONN_HANDLE),
              attMtuExchangeTimer_(nullptr) {
        connectingAddr_ = {};
    }
    ~ConnectionsManager() = default;
    int init();
    bool initialized() const {
        return connMgrInitialized_;
    }
    int setPpcp(const hal_ble_conn_params_t* ppcp);
    int getPpcp(hal_ble_conn_params_t* ppcp) const;
    bool connecting(const hal_ble_addr_t* address) const;
    bool connected(const hal_ble_addr_t* address = nullptr);
    int connect(const hal_ble_addr_t* address);
    int connectCancel(const hal_ble_addr_t* address);
    int disconnect(hal_ble_conn_handle_t connHandle);
    int disconnectAll();
    int updateConnectionParams(hal_ble_conn_handle_t connHandle, const hal_ble_conn_params_t* params);
    int getConnectionParams(hal_ble_conn_handle_t connHandle, hal_ble_conn_params_t* params);
    bool valid(hal_ble_conn_handle_t connHandle);
    ssize_t getAttMtu(hal_ble_conn_handle_t connHandle);
    int setDesiredAttMtu(size_t attMtu);

private:
    int configureAttMtu(hal_ble_conn_handle_t connHandle, size_t effective);
    bool attMtuExchanged(hal_ble_conn_handle_t connHandle);
    BleConnection* fetchConnection(hal_ble_conn_handle_t connHandle);
    BleConnection* fetchConnection(const hal_ble_addr_t* address);
    int addConnection(const BleConnection& connection);
    void removeConnection(hal_ble_conn_handle_t connHandle);
    void initiateConnParamsUpdateIfNeeded(const BleConnection* connection);
    bool isConnParamsFeeded(const hal_ble_conn_params_t* params) const;
    static void onAttMtuExchangeTimerExpired(os_timer_t timer);
    static ble_gap_conn_params_t toPlatformConnParams(const hal_ble_conn_params_t* halConnParams);
    static hal_ble_conn_params_t toHalConnParams(const ble_gap_conn_params_t* params);
    static void onConnParamsUpdateTimerExpired(os_timer_t timer);
    static void processConnectionEvents(const ble_evt_t* event, void* context);

    bool connMgrInitialized_;
    volatile bool isConnecting_;                                /**< If it is connecting or not. */
    hal_ble_addr_t connectingAddr_;                             /**< Address of peer the Central is connecting to. */
    volatile hal_ble_conn_handle_t disconnectingHandle_;        /**< Handle of connection to be disconnected. */
    volatile hal_ble_conn_handle_t centralConnParamUpdateHandle_;/**< Handle of the central connection to send peripheral connection update command. */
    volatile hal_ble_conn_handle_t periphConnParamUpdateHandle_;/**< Handle of the peripheral connection to send peripheral connection update request. */
    volatile uint8_t connParamsUpdateAttempts_;                 /**< Attempts for peripheral to update connection parameters. */
    os_timer_t connParamsUpdateTimer_;                          /**< Timer used for sending peripheral connection update request after connection established. */
    os_semaphore_t connParamsUpdateSemaphore_;                  /**< Semaphore to wait until connection parameters updated. */
    os_semaphore_t connectSemaphore_;                           /**< Semaphore to wait until connection established. */
    os_semaphore_t disconnectSemaphore_;                        /**< Semaphore to wait until connection disconnected. */
    AtomicIntrusiveList<BleConnection> connectionsList_;        /**< Current on-going connections. */
    AtomicAllocedPool connectionsPool_;
    volatile hal_ble_conn_handle_t attMtuExchangeConnHandle_;   /**< Current handle of the connection to execute ATT_MTU exchange procedure. */
    os_timer_t attMtuExchangeTimer_;                            /**< Timer used for sending the exchanging ATT_MTU request after connection established. */
    // GATT Server and GATT client share the same ATT_MTU.
    static size_t desiredAttMtu_;
};

size_t BleObject::ConnectionsManager::desiredAttMtu_ = BLE_MAX_ATT_MTU_SIZE;

class BleObject::GattServer : public GattBase {
public:
    GattServer()
            : gattsInitialized_(false),
              isHvxing_(false),
              currHvxConnHandle_(BLE_INVALID_CONN_HANDLE),
              hvxSemaphore_(nullptr) {
    }
    ~GattServer() = default;
    int init();
    bool initialized() const {
        return gattsInitialized_;
    }
    int addService(uint8_t type, const hal_ble_uuid_t* uuid, hal_ble_attr_handle_t* svcHandle);
    int addCharacteristic(hal_ble_attr_handle_t svcHandle, uint8_t properties, const hal_ble_uuid_t* uuid, const char* desc, hal_ble_char_handles_t* charHandles);
    int addDescriptor(hal_ble_attr_handle_t charHandle, const hal_ble_uuid_t* uuid, uint8_t* descriptor, size_t len, hal_ble_attr_handle_t* descHandle);
    ssize_t setValue(hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len);
    ssize_t getValue(hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len);

