particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
private:
    class BleCharacteristic {
        public:
            BleCharacteristic() {
                for (auto& cccdConnection : cccdConnections) {
                    cccdConnection = BLE_INVALID_CONN_HANDLE;
                }
            }
            ~BleCharacteristic() = default;

            uint8_t properties;
            hal_ble_attr_handle_t svcHandle;
            hal_ble_char_handles_t charHandles;
            hal_ble_conn_handle_t cccdConnections[BLE_MAX_LINK_COUNT];
    };

    bool findService(hal_ble_attr_handle_t svcHandle) const;
    BleCharacteristic* findCharacteristic(hal_ble_attr_handle_t attrHandle);
    void addToCccdList(BleCharacteristic* characteristic, hal_ble_conn_handle_t connHandle);
    void removeFromCCCDList(BleCharacteristic* characteristic, hal_ble_conn_handle_t connHandle);
    void removeFromAllCCCDList(hal_ble_conn_handle_t connHandle);
    static void gattsEventProcessedHook(const hal_ble_evts_t *event, void* context);
    static void processGattServerEvents(const ble_evt_t* event, void* context);

    bool gattsInitialized_;
    volatile bool isHvxing_;
    hal_ble_conn_handle_t currHvxConnHandle_;
    os_semaphore_t hvxSemaphore_;                   /**< Semaphore to wait until the HVX operation completed. */
    Vector<hal_ble_attr_handle_t> services_;        /**< Added services. */
    Vector<BleCharacteristic> characteristics_;     /**< Added characteristic. */
    AtomicAllocedPool gattsDataRecPool_;            /**< Pool to allocate memory for received data. */
};

class BleObject::GattClient : public GattBase {
public:
    GattClient()
            : gattcInitialized_(false),
              isDiscovering_(false),
              currDiscConnHandle_(BLE_INVALID_CONN_HANDLE),
              currDiscProcedure_(DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_IDLE),
              discoverySemaphore_(nullptr),
              isReading_(false),
              currReadConnHandle_(BLE_INVALID_CONN_HANDLE),
              readSemaphore_(nullptr),
              isWriting_(false),
              currWriteConnHandle_(BLE_INVALID_CONN_HANDLE),
              writeSemaphore_(nullptr),
              readAttrHandle_(BLE_INVALID_ATTR_HANDLE),
              readBuf_(nullptr),
              readLen_(0),
              gattcDataRecPoolInit_(false),
              gattcDiscPoolInit_(false) {
        resetDiscoveryState();
    }
    ~GattClient() = default;
    int init();
    bool initialized() const {
        return gattcInitialized_;
    }
    bool discovering(hal_ble_conn_handle_t connHandle) const;
    int discoverServices(hal_ble_conn_handle_t connHandle, const hal_ble_uuid_t* uuid, hal_ble_on_disc_service_cb_t callback, void* context);
    int discoverCharacteristics(hal_ble_conn_handle_t connHandle, const hal_ble_svc_t* service, hal_ble_on_disc_char_cb_t callback, void* context);
    ssize_t writeAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len, bool response);
    ssize_t readAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len);

private:
    enum class DiscoveryProcedure {
        BLE_DISCOVERY_PROCEDURE_IDLE = 0,
        BLE_DISCOVERY_PROCEDURE_SERVICES = 1,
        BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS = 2,
        BLE_DISCOVERY_PROCEDURE_DESCRIPTORS = 3,
    };

    struct DiscoveredService {
        DiscoveredService* next;
        hal_ble_svc_t service;
    };

    struct DiscoveredCharacteristic {
        DiscoveredCharacteristic* next;
        hal_ble_char_t characteristic;
    };

    void resetDiscoveryState();
    int addDiscoveredService(const hal_ble_svc_t& service);
    int addDiscoveredCharacteristic(const hal_ble_char_t& characteristic);
    bool readServiceUUID128IfNeeded() const;
    bool readCharacteristicUUID128IfNeeded() const;
    hal_ble_svc_t* findDiscoveredService(hal_ble_attr_handle_t attrHandle);
    hal_ble_char_t* findDiscoveredCharacteristic(hal_ble_attr_handle_t attrHandle);
    static void gattcEventProcessedHook(const hal_ble_evts_t *event, void* context);
    static void processGattClientEvents(const ble_evt_t* event, void* context);

    bool gattcInitialized_;
    bool discoverAll_;                                              /**< If it is going to discover all service during the service discovery procedure. */
    volatile bool isDiscovering_;                                   /**< If there is on-going discovery procedure. */
    hal_ble_conn_handle_t currDiscConnHandle_;                      /**< Current connection handle under which the service and characteristics to be discovered. */
    DiscoveryProcedure currDiscProcedure_;                          /**< Current discovery procedure. */
    hal_ble_svc_t currDiscSvc_;                                     /**< Current service to be discovered for the characteristics. */
    os_semaphore_t discoverySemaphore_;                             /**< Semaphore to wait until the discovery procedure completed. */
    volatile bool isReading_;
    hal_ble_conn_handle_t currReadConnHandle_;
    os_semaphore_t readSemaphore_;                                  /**< Semaphore to wait until the read operation completed. */
    volatile bool isWriting_;
    hal_ble_conn_handle_t currWriteConnHandle_;
    os_semaphore_t writeSemaphore_;                                 /**< Semaphore to wait until the write operation completed. */
    AtomicIntrusiveList<DiscoveredService> discServicesList_;       /**< Discover services. */
    AtomicIntrusiveList<DiscoveredCharacteristic> discCharacteristicsList_; /**< Discovered characteristics. */
    volatile size_t discServiceCount_;                              /**< Discovered service count. */
    volatile size_t discCharacteristicCount_;                       /**< Discovered characteristic count. */
    hal_ble_attr_handle_t readAttrHandle_;                          /**< Current handle of which attribute to be read. */
    uint8_t* readBuf_;                                              /**< Current buffer to be filled for the read data. */
    size_t readLen_;                                                /**< Length of read data. */
    bool gattcDataRecPoolInit_;
    bool gattcDiscPoolInit_;
    AtomicAllocedPool gattcDataRecPool_;                            /**< Pool to allocate memory for received data. */
    AtomicAllocedPool gattcDiscPool_;                               /**< Pool to allocate memory for service/characteristic discovery. */

