particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
};

int BleObject::BleEventDispatcher::init() {
    genericEventHandlers_.clear();
    if (os_queue_create(&evtQueue_, sizeof(EventMessage), BLE_EVENT_QUEUE_ITEM_COUNT, nullptr)) {
        evtQueue_ = nullptr;
        LOG(ERROR, "os_queue_create() failed");
        goto error;
    }
    if (os_thread_create(&evtThread_, "BLE Event Thread", OS_THREAD_PRIORITY_NETWORK, bleEventDispatch, this, BLE_EVENT_THREAD_STACK_SIZE)) {
        evtThread_ = nullptr;
        LOG(ERROR, "os_thread_create() failed");
        goto error;
    }
    evtDispatcherinitialized_ = true;
    return SYSTEM_ERROR_NONE;
error:
    if (evtQueue_) {
        os_queue_destroy(evtQueue_, nullptr);
        evtQueue_ = nullptr;
    }
    if (evtThread_) {
        os_thread_exit(evtThread_);
        evtThread_ = nullptr;
    }
    return SYSTEM_ERROR_INTERNAL;
}

int BleObject::BleEventDispatcher::enqueue(EventMessage& msg) {
    if (os_queue_put(evtQueue_, &msg, 0, nullptr)) {
        LOG(ERROR, "os_queue_put() failed.");
        // Free the memory if needed.
        if (msg.hook && msg.hookContext) {
            msg.hook(&msg.evt, msg.hookContext);
        }
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

void BleObject::BleEventDispatcher::onGenericEventCallback(hal_ble_on_generic_evt_cb_t cb, void* context) {
    BleGenericEventHandler evtHandler;
    evtHandler.handler = cb;
    evtHandler.context = context;
    genericEventHandlers_.append(evtHandler);
}

os_thread_return_t BleObject::BleEventDispatcher::bleEventDispatch(void* param) {
    BleEventDispatcher* dispatcher = static_cast<BleEventDispatcher*>(param);
    while (1) {
        EventMessage msg;
        if (!os_queue_take(dispatcher->evtQueue_, &msg, CONCURRENT_WAIT_FOREVER, nullptr)) {
            if (msg.handler) {
                // Invoke the handler registered by specific application.
                if (msg.evt.type == BLE_EVT_SCAN_RESULT) {
                    msg.handler(&msg.evt.params.scan_result, msg.context);
                } else if (msg.evt.type == BLE_EVT_SVC_DISCOVERED) {
                    msg.handler(&msg.evt.params.svc_disc, msg.context);
                } else if (msg.evt.type == BLE_EVT_CHAR_DISCOVERED) {
                    msg.handler(&msg.evt.params.char_disc, msg.context);
                }
            } else {
                // Just dispatch the event to the application those have subscribed the generic events.
                for (auto& evtHandler : dispatcher->genericEventHandlers_) {
                    if (evtHandler.handler) {
                        evtHandler.handler(&msg.evt, evtHandler.context);
                    }
                }
            }
            // Free the memory if needed.
            if (msg.hook) {
                msg.hook(&msg.evt, msg.hookContext);
            }
        } else {
            LOG(ERROR, "BLE event thread exited.");
            break;
        }
    }
    os_thread_exit(dispatcher->evtThread_);
}

struct BleGapImpl {
    BleObject::BleGap* instance;
};
static BleGapImpl bleGapImpl;

int BleObject::BleGap::init() {
    // Set the default device name
    char devName[32] = {};
    CHECK(get_device_name(devName, sizeof(devName)));
    CHECK(setDeviceName(devName, strlen(devName)));
    bleGapImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleGap, 1, processBleGapEvents, &bleGapImpl);
    gapInitialized_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::setDeviceName(const char* deviceName, size_t len) const {
    char name[32] = {};
    if (deviceName == nullptr || len == 0) {
        CHECK(get_device_name(name, sizeof(name)));
        len = strlen(name);
    } else {
        len = std::min(len, sizeof(name));
        memcpy(name, deviceName, len);
    }
    ble_gap_conn_sec_mode_t secMode;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&secMode);
    int ret = sd_ble_gap_device_name_set(&secMode, (const uint8_t*)name, len);
    return nrf_system_error(ret);
}

int BleObject::BleGap::getDeviceName(char* deviceName, size_t len) const {
    CHECK_TRUE(deviceName, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(len, SYSTEM_ERROR_INVALID_ARGUMENT);
    // non NULL-terminated string returned.
    uint16_t nameLen = len - 1;
    int ret = sd_ble_gap_device_name_get((uint8_t*)deviceName, &nameLen);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    nameLen = std::min(len - 1, (size_t)nameLen);
    deviceName[nameLen] = '\0';
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::setDeviceAddress(const hal_ble_addr_t* address) const {
    // The identity address cannot be changed while advertising, scanning or creating a connection.
    CHECK_FALSE(BleObject::getInstance().broadcaster()->advertising(), SYSTEM_ERROR_INVALID_STATE);
    CHECK_FALSE(BleObject::getInstance().observer()->scanning(), SYSTEM_ERROR_INVALID_STATE);
    CHECK_FALSE(BleObject::getInstance().connMgr()->connecting(address), SYSTEM_ERROR_INVALID_STATE);
    hal_ble_addr_t newAddr = {};
    if (address == nullptr) {
        newAddr = chipDefaultAddress();
    } else {
        newAddr = *address;
    }
    if (newAddr.addr_type != BLE_SIG_ADDR_TYPE_PUBLIC && newAddr.addr_type != BLE_SIG_ADDR_TYPE_RANDOM_STATIC) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    ble_gap_addr_t localAddr;
    localAddr.addr_id_peer = false;
    localAddr.addr_type = newAddr.addr_type;
    memcpy(localAddr.addr, newAddr.addr, BLE_SIG_ADDR_LEN);
    int ret = sd_ble_gap_addr_set(&localAddr);
    return nrf_system_error(ret);
}

int BleObject::BleGap::getDeviceAddress(hal_ble_addr_t* address) const {
    CHECK_TRUE(address, SYSTEM_ERROR_INVALID_ARGUMENT);
    ble_gap_addr_t localAddr;
    int ret = sd_ble_gap_addr_get(&localAddr);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    address->addr_type = (ble_sig_addr_type_t)localAddr.addr_type;
    memcpy(address->addr, localAddr.addr, BLE_SIG_ADDR_LEN);
    return SYSTEM_ERROR_NONE;
}

int BleObject::BleGap::setAppearance(ble_sig_appearance_t appearance) const {
    int ret = sd_ble_gap_appearance_set((uint16_t)appearance);
    return nrf_system_error(ret);
}

