particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
struct ConnectionsManagerImpl {
    BleObject::ConnectionsManager* instance;
};
static ConnectionsManagerImpl connMgrImpl;

int BleObject::ConnectionsManager::init() {
    /*
     * Default Peripheral Preferred Connection Parameters.
     * For BLE Central, this is the initial connection parameters.
     * For BLE Peripheral, this is the Peripheral Preferred Connection Parameters.
     */
    ble_gap_conn_params_t bleGapConnParams = {};
    bleGapConnParams.min_conn_interval = BLE_DEFAULT_MIN_CONN_INTERVAL;
    bleGapConnParams.max_conn_interval = BLE_DEFAULT_MAX_CONN_INTERVAL;
    bleGapConnParams.slave_latency = BLE_DEFAULT_SLAVE_LATENCY;
    bleGapConnParams.conn_sup_timeout = BLE_DEFAULT_CONN_SUP_TIMEOUT;
    int ret = sd_ble_gap_ppcp_set(&bleGapConnParams);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    if (os_semaphore_create(&connectSemaphore_, 1, 0)) {
        connectSemaphore_ = nullptr;
        LOG(ERROR, "os_semaphore_create() failed");
        goto error;
    }
    if (os_semaphore_create(&disconnectSemaphore_, 1, 0)) {
        disconnectSemaphore_ = nullptr;
        LOG(ERROR, "os_semaphore_create() failed");
        goto error;
    }
    if (os_semaphore_create(&connParamsUpdateSemaphore_, 1, 0)) {
        connParamsUpdateSemaphore_ = nullptr;
        LOG(ERROR, "os_semaphore_create() failed");
        goto error;
    }
    if (os_timer_create(&connParamsUpdateTimer_, BLE_CONN_PARAMS_UPDATE_DELAY_MS, onConnParamsUpdateTimerExpired, this, true, nullptr)) {
        connParamsUpdateTimer_ = nullptr;
        LOG(ERROR, "os_timer_create() failed.");
        goto error;
    }
    if (os_timer_create(&attMtuExchangeTimer_, BLE_ATT_MTU_EXCHANGE_DELAY_MS, onAttMtuExchangeTimerExpired, this, true, nullptr)) {
        attMtuExchangeTimer_ = nullptr;
        LOG(ERROR, "os_timer_create() failed.");
        goto error;
    }
    ret = connectionsPool_.init(CONNECTIONS_POOL_SIZE);
    if (ret != SYSTEM_ERROR_NONE) {
        goto error;
    }
    connMgrImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleConnectionManager, 1, processConnectionEvents, &connMgrImpl);
    connMgrInitialized_ = true;
    return SYSTEM_ERROR_NONE;
error:
    if (connectSemaphore_) {
        os_semaphore_destroy(connectSemaphore_);
        connectSemaphore_ = nullptr;
    }
    if (disconnectSemaphore_) {
        os_semaphore_destroy(disconnectSemaphore_);
        disconnectSemaphore_ = nullptr;
    }
    if (connParamsUpdateSemaphore_) {
        os_semaphore_destroy(connParamsUpdateSemaphore_);
        connParamsUpdateSemaphore_ = nullptr;
    }
    if (connParamsUpdateTimer_) {
        os_timer_destroy(connParamsUpdateTimer_, nullptr);
        connParamsUpdateTimer_ = nullptr;
    }
    if (attMtuExchangeTimer_) {
        os_timer_destroy(attMtuExchangeTimer_, nullptr);
        attMtuExchangeTimer_ = nullptr;
    }
    return SYSTEM_ERROR_INTERNAL;
}

int BleObject::ConnectionsManager::setPpcp(const hal_ble_conn_params_t* ppcp) {
    CHECK_TRUE(ppcp, SYSTEM_ERROR_INVALID_ARGUMENT);
    if (ppcp->min_conn_interval != BLE_SIG_CP_MIN_CONN_INTERVAL_NONE) {
        CHECK_TRUE(ppcp->min_conn_interval > BLE_SIG_CP_MIN_CONN_INTERVAL_MIN, SYSTEM_ERROR_INVALID_ARGUMENT);
        CHECK_TRUE(ppcp->min_conn_interval < BLE_SIG_CP_MIN_CONN_INTERVAL_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    }
    if (ppcp->max_conn_interval != BLE_SIG_CP_MAX_CONN_INTERVAL_NONE) {
        CHECK_TRUE(ppcp->max_conn_interval > BLE_SIG_CP_MAX_CONN_INTERVAL_MIN, SYSTEM_ERROR_INVALID_ARGUMENT);
        CHECK_TRUE(ppcp->max_conn_interval < BLE_SIG_CP_MAX_CONN_INTERVAL_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    }
    CHECK_TRUE(ppcp->slave_latency < BLE_SIG_CP_SLAVE_LATENCY_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    if (ppcp->conn_sup_timeout != BLE_SIG_CP_CONN_SUP_TIMEOUT_NONE) {
        CHECK_TRUE(ppcp->conn_sup_timeout > BLE_SIG_CP_CONN_SUP_TIMEOUT_MIN, SYSTEM_ERROR_INVALID_ARGUMENT);
        CHECK_TRUE(ppcp->conn_sup_timeout < BLE_SIG_CP_CONN_SUP_TIMEOUT_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    }
    ble_gap_conn_params_t bleGapConnParams = toPlatformConnParams(ppcp);
    int ret = sd_ble_gap_ppcp_set(&bleGapConnParams);
    return nrf_system_error(ret);
}

int BleObject::ConnectionsManager::getPpcp(hal_ble_conn_params_t* ppcp) const {
    CHECK_TRUE(ppcp, SYSTEM_ERROR_INVALID_ARGUMENT);
    ble_gap_conn_params_t bleGapConnParams = {};
    int ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    *ppcp = toHalConnParams(&bleGapConnParams);
    return SYSTEM_ERROR_NONE;
}

bool BleObject::ConnectionsManager::connecting(const hal_ble_addr_t* address) const {
    // TODO: several links are being established concurrently.
    return isConnecting_;
}

bool BleObject::ConnectionsManager::connected(const hal_ble_addr_t* address) {
    if (address == nullptr) {
        // Check if local device is connected as BLE Peripheral.
        auto connection = connectionsList_.front();
        while (connection) {
            if (connection->role == BLE_ROLE_PERIPHERAL) {
                return true;
            }
            connection = connection->next;
        }
        return false;
    }
    if (fetchConnection(address)) {
        return true;
    }
    return false;
}

int BleObject::ConnectionsManager::connect(const hal_ble_addr_t* address) {
    // Stop scanning first to give the scanning semaphore if possible.
    int ret;
    CHECK(BleObject::getInstance().observer()->stopScanning());
    SCOPE_GUARD ({
        connectingAddr_ = {};
    });
    ble_gap_addr_t bleDevAddr = {};
    bleDevAddr.addr_type = address->addr_type;
    memcpy(bleDevAddr.addr, address->addr, BLE_SIG_ADDR_LEN);
    ble_gap_scan_params_t bleGapScanParams = BleObject::getInstance().observer()->toPlatformScanParams();
    ble_gap_conn_params_t bleGapConnParams = {};
    ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    ret = sd_ble_gap_connect(&bleDevAddr, &bleGapScanParams, &bleGapConnParams, BLE_CONN_CFG_TAG);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isConnecting_ = true;
    memcpy(&connectingAddr_, address, sizeof(hal_ble_addr_t));
    if (os_semaphore_take(connectSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    // FIXME: if the semaphore is given due to a GAP timeout event.
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::connectCancel(const hal_ble_addr_t* address) {
    CHECK_TRUE(isConnecting_, SYSTEM_ERROR_INVALID_STATE);
    CHECK_TRUE(address, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(addressEqual(connectingAddr_, *address), SYSTEM_ERROR_INVALID_ARGUMENT);
    int ret = sd_ble_gap_connect_cancel();
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    bool give = false;
    ATOMIC_BLOCK() {
        if (isConnecting_) {
            isConnecting_ = false;
            give = true;
        }
    }
    if (give) {
        os_semaphore_give(connectSemaphore_, false);
    }
    return SYSTEM_ERROR_NONE;
}

