particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::ConnectionsManager::disconnect(hal_ble_conn_handle_t connHandle) {
    CHECK_TRUE(fetchConnection(connHandle), SYSTEM_ERROR_NOT_FOUND);
    SCOPE_GUARD ({
        disconnectingHandle_ = BLE_INVALID_CONN_HANDLE;
    });
    int ret = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    disconnectingHandle_ = connHandle;
    if (os_semaphore_take(disconnectSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::disconnectAll() {
    BleConnection* connection = nullptr;
    do {
        connection = connectionsList_.popFront();
        if (connection) {
            disconnect(connection->connHandle);
            BleConnection* curr = connection;
            connectionsPool_.free(curr);
        }
    } while (connection);
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::updateConnectionParams(hal_ble_conn_handle_t connHandle, const hal_ble_conn_params_t* params) {
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    SCOPE_GUARD ({
        periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        centralConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
    });
    if (connection->role == BLE_ROLE_PERIPHERAL) {
        // If the automatic peripheral connection parameters update procedure is started.
        if (!os_timer_is_active(connParamsUpdateTimer_, nullptr)) {
            periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
            connParamsUpdateAttempts_ = 0;
            os_timer_change(connParamsUpdateTimer_, OS_TIMER_CHANGE_STOP, true, 0, 0, nullptr);
        }
    }
    ble_gap_conn_params_t bleGapConnParams = {};
    if (params == nullptr) {
        // Use the PPCP characteristic value as the connection parameters.
        int ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    } else {
        bleGapConnParams = toPlatformConnParams(params);
    }
    if (connection->role == BLE_ROLE_PERIPHERAL) {
        periphConnParamUpdateHandle_ = connHandle;
    } else {
        centralConnParamUpdateHandle_ = connHandle;
    }
    // For Central role, this will initiate the connection parameter update procedure.
    // For Peripheral role, this will use the passed in parameters and send the request to central.
    int ret = sd_ble_gap_conn_param_update(connHandle, &bleGapConnParams);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    if (os_semaphore_take(connParamsUpdateSemaphore_, CONNECTION_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::getConnectionParams(hal_ble_conn_handle_t connHandle, hal_ble_conn_params_t* params) {
    const BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    memcpy(params, &connection->effectiveConnParams, std::min(params->size, connection->effectiveConnParams.size));
    return SYSTEM_ERROR_NONE;
}

bool BleObject::ConnectionsManager::valid(hal_ble_conn_handle_t connHandle) {
    const BleConnection* connection = fetchConnection(connHandle);
    return connection != nullptr;
}

ble_gap_conn_params_t BleObject::ConnectionsManager::toPlatformConnParams(const hal_ble_conn_params_t* halConnParams) {
    ble_gap_conn_params_t params = {};
    params.min_conn_interval = halConnParams->min_conn_interval;
    params.max_conn_interval = halConnParams->max_conn_interval;
    params.slave_latency = halConnParams->slave_latency;
    params.conn_sup_timeout = halConnParams->conn_sup_timeout;
    return params;
}

hal_ble_conn_params_t BleObject::ConnectionsManager::toHalConnParams(const ble_gap_conn_params_t* params) {
    hal_ble_conn_params_t halConnParams = {};
    halConnParams.version = BLE_API_VERSION;
    halConnParams.size = sizeof(hal_ble_conn_params_t);
    halConnParams.min_conn_interval = params->min_conn_interval;
    halConnParams.max_conn_interval = params->max_conn_interval;
    halConnParams.slave_latency = params->slave_latency;
    halConnParams.conn_sup_timeout = params->conn_sup_timeout;
    return halConnParams;
}

ssize_t BleObject::ConnectionsManager::getAttMtu(hal_ble_conn_handle_t connHandle) {
    const auto connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    return connection->effectiveMtu;
}

int BleObject::ConnectionsManager::configureAttMtu(hal_ble_conn_handle_t connHandle, size_t effective) {
    auto connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    connection->effectiveMtu = effective;
    connection->isMtuExchanged = true;
    return SYSTEM_ERROR_NONE;
}

bool BleObject::ConnectionsManager::attMtuExchanged(hal_ble_conn_handle_t connHandle) {
    const auto connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, false);
    return connection->isMtuExchanged;
}

BleObject::ConnectionsManager::BleConnection* BleObject::ConnectionsManager::fetchConnection(hal_ble_conn_handle_t connHandle) {
    CHECK_TRUE(connHandle != BLE_INVALID_CONN_HANDLE, nullptr);
    auto connection = connectionsList_.front();
    while (connection) {
        if (connection->connHandle == connHandle) {
            return connection;
        }
        connection = connection->next;
    }
    return nullptr;
}

BleObject::ConnectionsManager::BleConnection* BleObject::ConnectionsManager::fetchConnection(const hal_ble_addr_t* address) {
    CHECK_TRUE(address, nullptr);
    auto connection = connectionsList_.front();
    while (connection) {
        if (addressEqual(connection->peer, *address)) {
            return connection;
        }
        connection = connection->next;
    }
    return nullptr;
}

int BleObject::ConnectionsManager::addConnection(const BleConnection& connection) {
    removeConnection(connection.connHandle);
    BleConnection* conn = (BleConnection*)connectionsPool_.alloc(sizeof(BleConnection));
    CHECK_TRUE(conn, SYSTEM_ERROR_NO_MEMORY);
    *conn = connection;
    connectionsList_.pushFront(conn);
    return SYSTEM_ERROR_NONE;
}

void BleObject::ConnectionsManager::removeConnection(hal_ble_conn_handle_t connHandle) {
    auto connection = connectionsList_.front();
    BleConnection* prev = nullptr;
    while (connection) {
        if (connection->connHandle == connHandle) {
            BleConnection* curr = connectionsList_.pop(connection, prev);
            connection = curr->next;
            connectionsPool_.free(curr);
            continue;
        }
        prev = connection;
        connection = connection->next;
    }
}

void BleObject::ConnectionsManager::initiateConnParamsUpdateIfNeeded(const BleConnection* connection) {
    if (connParamsUpdateTimer_ == nullptr) {
        return;
    }
    if (connParamsUpdateAttempts_ == 0 && periphConnParamUpdateHandle_ != BLE_INVALID_CONN_HANDLE) {
        // If the peripheral connection parameters update procedure has been initiated by application.
        return;
    }
    if (isConnParamsFeeded(&connection->effectiveConnParams)) {
        return;
    }
    if (connParamsUpdateAttempts_ < BLE_CONN_PARAMS_UPDATE_ATTEMPS) {
        if (!os_timer_change(connParamsUpdateTimer_, OS_TIMER_CHANGE_START, true, 0, 0, nullptr)) {
            periphConnParamUpdateHandle_ = connection->connHandle;
            LOG_DEBUG(TRACE, "Attempts to update BLE connection parameters, try: %d after %d ms", connParamsUpdateAttempts_, BLE_CONN_PARAMS_UPDATE_DELAY_MS);
        }
        return;
    }
    periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
    connParamsUpdateAttempts_ = 0;
    sd_ble_gap_disconnect(connection->connHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
}

bool BleObject::ConnectionsManager::isConnParamsFeeded(const hal_ble_conn_params_t* params) const {
    hal_ble_conn_params_t ppcp = {};
    CHECK_RETURN(getPpcp(&ppcp), true);
    uint16_t minAcceptedSl = ppcp.slave_latency - std::min((uint16_t)BLE_CONN_PARAMS_SLAVE_LATENCY_ERR, ppcp.slave_latency);
    uint16_t maxAcceptedSl = ppcp.slave_latency + BLE_CONN_PARAMS_SLAVE_LATENCY_ERR;
    uint16_t minAcceptedTo = ppcp.conn_sup_timeout - std::min((uint16_t)BLE_CONN_PARAMS_TIMEOUT_ERR, ppcp.conn_sup_timeout);
    uint16_t maxAcceptedTo = ppcp.conn_sup_timeout + BLE_CONN_PARAMS_TIMEOUT_ERR;
    if (params->max_conn_interval < ppcp.min_conn_interval || params->max_conn_interval > ppcp.max_conn_interval) {
        return false;
    }
    if (params->slave_latency < minAcceptedSl || params->slave_latency > maxAcceptedSl) {
        return false;
    }
    if (params->conn_sup_timeout < minAcceptedTo || params->conn_sup_timeout > maxAcceptedTo) {
        return false;
    }
    return true;
}

