particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::ConnectionsManager::setDesiredAttMtu(size_t attMtu) {
    desiredAttMtu_ = std::min(attMtu, (size_t)BLE_MAX_ATT_MTU_SIZE);
    return SYSTEM_ERROR_NONE;
}

void BleObject::ConnectionsManager::onAttMtuExchangeTimerExpired(os_timer_t timer) {
    ConnectionsManager* connMgr;
    os_timer_get_id(timer, (void**)&connMgr);
    if (connMgr->attMtuExchanged(connMgr->attMtuExchangeConnHandle_)) {
        return;
    }
    LOG_DEBUG(TRACE, "Request to change ATT_MTU from %d to %d", BLE_DEFAULT_ATT_MTU_SIZE, connMgr->desiredAttMtu_);
    int ret = sd_ble_gattc_exchange_mtu_request(connMgr->attMtuExchangeConnHandle_, connMgr->desiredAttMtu_);
    if (ret != NRF_SUCCESS) {
        LOG_DEBUG(TRACE, "sd_ble_gattc_exchange_mtu_request() failed: %d", ret);
    }
}

void BleObject::ConnectionsManager::onConnParamsUpdateTimerExpired(os_timer_t timer) {
    ConnectionsManager* connMgr;
    os_timer_get_id(timer, (void**)&connMgr);
    if (connMgr->periphConnParamUpdateHandle_ == BLE_INVALID_CONN_HANDLE) {
        return;
    }
    // For Peripheral, it will use the PPCP characteristic value.
    int ret = sd_ble_gap_conn_param_update(connMgr->periphConnParamUpdateHandle_, nullptr);
    if (ret != NRF_SUCCESS) {
        connMgr->periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        connMgr->connParamsUpdateAttempts_ = 0;
        sd_ble_gap_disconnect(connMgr->periphConnParamUpdateHandle_, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
        return;
    }
    connMgr->connParamsUpdateAttempts_++;
}

void BleObject::ConnectionsManager::processConnectionEvents(const ble_evt_t* event, void* context) {
    ConnectionsManager* connMgr = static_cast<ConnectionsManagerImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED: {
            const ble_gap_evt_connected_t& connected = event->evt.gap_evt.params.connected;
            LOG_DEBUG(TRACE, "BLE GAP event: connected.");
            BleConnection newConnection = {};
            newConnection.role = (hal_ble_role_t)connected.role;
            newConnection.connHandle = event->evt.gap_evt.conn_handle;
            newConnection.effectiveConnParams = connMgr->toHalConnParams(&connected.conn_params);
            newConnection.peer.addr_type = (ble_sig_addr_type_t)connected.peer_addr.addr_type;
            memcpy(newConnection.peer.addr, connected.peer_addr.addr, BLE_SIG_ADDR_LEN);
            // Use the default ATT_MTU on connected.
            newConnection.effectiveMtu = BLE_DEFAULT_ATT_MTU_SIZE;
            newConnection.isMtuExchanged = false;
            connMgr->addConnection(newConnection);
            LOG_DEBUG(TRACE, "BLE role: %d, connection handle: %d", newConnection.role, newConnection.connHandle);
            LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
            LOG_DEBUG(TRACE, "  %d*1.25          %d       %d*10", newConnection.effectiveConnParams.max_conn_interval,
                    newConnection.effectiveConnParams.slave_latency, newConnection.effectiveConnParams.conn_sup_timeout);
            // If the connection is initiated by Central.
            if (connMgr->isConnecting_ && newConnection.role == BLE_ROLE_CENTRAL && addressEqual(newConnection.peer, connMgr->connectingAddr_)) {
                connMgr->isConnecting_ = false;
                os_semaphore_give(connMgr->connectSemaphore_, false);
            }
            // Update connection parameters if needed.
            if (newConnection.role == BLE_ROLE_PERIPHERAL) {
                connMgr->connParamsUpdateAttempts_ = 0;
                connMgr->initiateConnParamsUpdateIfNeeded(&newConnection);
            }
            if (connMgr->desiredAttMtu_ > BLE_DEFAULT_ATT_MTU_SIZE) {
                // FIXME: What if there is another new connection established before the timer expired?
                if (!os_timer_change(connMgr->attMtuExchangeTimer_, OS_TIMER_CHANGE_START, true, 0, 0, nullptr)) {
                    LOG_DEBUG(TRACE, "Attempts to exchange ATT_MTU if needed.");
                    connMgr->attMtuExchangeConnHandle_ = event->evt.gap_evt.conn_handle;
                }
            }
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_CONNECTED;
            msg.evt.version = BLE_API_VERSION;
            msg.evt.size = sizeof(hal_ble_evts_t);
            msg.evt.params.connected.role = newConnection.role;
            msg.evt.params.connected.conn_handle = newConnection.connHandle;
            msg.evt.params.connected.conn_interval = newConnection.effectiveConnParams.max_conn_interval;
            msg.evt.params.connected.slave_latency = newConnection.effectiveConnParams.slave_latency;
            msg.evt.params.connected.conn_sup_timeout = newConnection.effectiveConnParams.conn_sup_timeout;
            msg.evt.params.connected.peer_addr.addr_type = newConnection.peer.addr_type;
            memcpy(msg.evt.params.connected.peer_addr.addr, newConnection.peer.addr, BLE_SIG_ADDR_LEN);
            BleObject::getInstance().dispatcher()->enqueue(msg);
            break;
        }
        case BLE_GAP_EVT_DISCONNECTED: {
            const ble_gap_evt_disconnected_t& disconnected = event->evt.gap_evt.params.disconnected;
            LOG_DEBUG(TRACE, "BLE GAP event: disconnected, handle: 0x%04X, reason: %d", event->evt.gap_evt.conn_handle, disconnected.reason);
            BleConnection* connection = connMgr->fetchConnection(event->evt.gap_evt.conn_handle);
            if (!connection) {
                LOG(ERROR, "Connection not found.");
                return;
            }
            // Cancel the on-going connection parameters update procedure.
            if (connMgr->periphConnParamUpdateHandle_ == event->evt.gap_evt.conn_handle) {
                if (!os_timer_is_active(connMgr->connParamsUpdateTimer_, nullptr)) {
                    connMgr->connParamsUpdateAttempts_ = 0;
                    connMgr->periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
                    os_timer_change(connMgr->connParamsUpdateTimer_, OS_TIMER_CHANGE_STOP, true, 0, 0, nullptr);
                } else {
                    connMgr->periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
                    os_semaphore_give(connMgr->connParamsUpdateSemaphore_, false);
                }
            }
            if (connMgr->centralConnParamUpdateHandle_ == event->evt.gap_evt.conn_handle) {
                connMgr->centralConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
                os_semaphore_give(connMgr->connParamsUpdateSemaphore_, false);
            }
            // If the disconnection is initiated by application.
            if (connMgr->disconnectingHandle_ == event->evt.gap_evt.conn_handle) {
                os_semaphore_give(connMgr->disconnectSemaphore_, false);
            }
            // If the ATT MTU exchanging procedure is on-going.
            if (!os_timer_is_active(connMgr->attMtuExchangeTimer_, nullptr)) {
                os_timer_change(connMgr->attMtuExchangeTimer_, OS_TIMER_CHANGE_STOP, true, 0, 0, nullptr);
            }
            connMgr->removeConnection(event->evt.gap_evt.conn_handle);
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_DISCONNECTED;
            msg.evt.version = BLE_API_VERSION;
            msg.evt.size = sizeof(hal_ble_evts_t);
            msg.evt.params.disconnected.reason = disconnected.reason;
            msg.evt.params.disconnected.conn_handle = event->evt.gap_evt.conn_handle;
            BleObject::getInstance().dispatcher()->enqueue(msg);
            break;
        }
        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: connection parameter update request.");
            int ret = sd_ble_gap_conn_param_update(event->evt.gap_evt.conn_handle,
                    &event->evt.gap_evt.params.conn_param_update_request.conn_params);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
            }
            break;
        }
        case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
            const ble_gap_evt_conn_param_update_t& connParaUpdate = event->evt.gap_evt.params.conn_param_update;
            LOG_DEBUG(TRACE, "BLE GAP event: connection parameter updated.");
            BleConnection* connection = connMgr->fetchConnection(event->evt.gap_evt.conn_handle);
            if (!connection) {
                LOG(ERROR, "Connection not found.");
                return;
            }
            connection->effectiveConnParams = connMgr->toHalConnParams(&connParaUpdate.conn_params);
            LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
            LOG_DEBUG(TRACE, "  %d*1.25          %d       %d*10", connection->effectiveConnParams.max_conn_interval,
                    connection->effectiveConnParams.slave_latency, connection->effectiveConnParams.conn_sup_timeout);
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_CONN_PARAMS_UPDATED;
            msg.evt.version = BLE_API_VERSION;
            msg.evt.size = sizeof(hal_ble_evts_t);
            msg.evt.params.conn_params_updated.conn_handle = event->evt.gap_evt.conn_handle;
            msg.evt.params.conn_params_updated.conn_interval = connParaUpdate.conn_params.max_conn_interval;
            msg.evt.params.conn_params_updated.slave_latency = connParaUpdate.conn_params.slave_latency;
            msg.evt.params.conn_params_updated.conn_sup_timeout = connParaUpdate.conn_params.conn_sup_timeout;
            BleObject::getInstance().dispatcher()->enqueue(msg);
            if (connMgr->periphConnParamUpdateHandle_ == event->evt.gap_evt.conn_handle) {
                if (!os_timer_is_active(connMgr->connParamsUpdateTimer_, nullptr)) {
                    connMgr->initiateConnParamsUpdateIfNeeded(connection);
                } else {
                    connMgr->periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
                    os_semaphore_give(connMgr->connParamsUpdateSemaphore_, false);
                }
                return;
            }
            if (connMgr->centralConnParamUpdateHandle_ == event->evt.gap_evt.conn_handle) {
                connMgr->centralConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
                os_semaphore_give(connMgr->connParamsUpdateSemaphore_, false);
                return;
            }
            break;
        }
        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN) {
                LOG_DEBUG(ERROR, "BLE GAP event: Connection timeout");
                if (connMgr->isConnecting_) {
                    connMgr->isConnecting_ = false;
                    os_semaphore_give(connMgr->connectSemaphore_, false);
                }
            }
            break;
        }
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
            const ble_gatts_evt_exchange_mtu_request_t& mtuRequest = event->evt.gatts_evt.params.exchange_mtu_request;
            LOG_DEBUG(TRACE, "BLE GATT Server event: exchange ATT MTU request: %d, desired: %d", mtuRequest.client_rx_mtu, connMgr->desiredAttMtu_);
            int ret = sd_ble_gatts_exchange_mtu_reply(event->evt.gatts_evt.conn_handle, connMgr->desiredAttMtu_);
            if (ret != NRF_SUCCESS) {
                LOG_DEBUG(TRACE, "sd_ble_gatts_exchange_mtu_reply() failed: %d", ret);
                return;
            }
            size_t effectAttMtu = std::min((size_t)mtuRequest.client_rx_mtu, connMgr->desiredAttMtu_);
            effectAttMtu = std::max(effectAttMtu, (size_t)BLE_MIN_ATT_MTU_SIZE);
            connMgr->configureAttMtu(event->evt.gatts_evt.conn_handle, effectAttMtu);
            LOG_DEBUG(TRACE, "Effective ATT MTU: %d.", effectAttMtu);
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_GATT_PARAMS_UPDATED;
            msg.evt.version = BLE_API_VERSION;
            msg.evt.size = sizeof(hal_ble_evts_t);
            msg.evt.params.gatt_params_updated.conn_handle = event->evt.gatts_evt.conn_handle;
            msg.evt.params.gatt_params_updated.att_mtu_size = effectAttMtu;
            BleObject::getInstance().dispatcher()->enqueue(msg);
            break;
        }
        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: {
            const ble_gattc_evt_exchange_mtu_rsp_t& attMtuRsp = event->evt.gattc_evt.params.exchange_mtu_rsp;
            size_t effectAttMtu = std::min((size_t)attMtuRsp.server_rx_mtu, connMgr->desiredAttMtu_);
            effectAttMtu = std::max(effectAttMtu, (size_t)BLE_MIN_ATT_MTU_SIZE);
            connMgr->configureAttMtu(event->evt.gatts_evt.conn_handle, effectAttMtu);
            LOG_DEBUG(TRACE, "BLE GATT Client event: exchange ATT MTU response: %d, effective: %d", attMtuRsp.server_rx_mtu, effectAttMtu);
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_GATT_PARAMS_UPDATED;
            msg.evt.version = BLE_API_VERSION;
            msg.evt.size = sizeof(hal_ble_evts_t);
            msg.evt.params.gatt_params_updated.conn_handle = event->evt.gatts_evt.conn_handle;
            msg.evt.params.gatt_params_updated.att_mtu_size = effectAttMtu;
            BleObject::getInstance().dispatcher()->enqueue(msg);
            break;
        }
        default: {
            break;
        }
    }
}

struct GattServerImpl {
    BleObject::GattServer* instance;
};
static GattServerImpl gattsImpl;

