particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
bool BleObject::GattClient::discovering(hal_ble_conn_handle_t connHandle) const {
    // TODO: discovering service and characteristic on multi-links concurrently.
    return isDiscovering_;
}

int BleObject::GattClient::discoverServices(hal_ble_conn_handle_t connHandle, const hal_ble_uuid_t* uuid, hal_ble_on_disc_service_cb_t callback, void* context) {
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    CHECK_FALSE(isDiscovering_, SYSTEM_ERROR_INVALID_STATE);
    SCOPE_GUARD ({
        resetDiscoveryState();
    });
    currDiscConnHandle_ = connHandle;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_SERVICES;
    int ret;
    if (uuid == nullptr) {
        discoverAll_ = true;
        ret = sd_ble_gattc_primary_services_discover(connHandle, SERVICES_BASE_START_HANDLE, nullptr);
    } else {
        ble_uuid_t svcUUID;
        BleObject::toPlatformUUID(uuid, &svcUUID);
        ret = sd_ble_gattc_primary_services_discover(connHandle, SERVICES_BASE_START_HANDLE, &svcUUID);
    }
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isDiscovering_ = true;
    if (os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    hal_ble_svc_t* services = (hal_ble_svc_t*)malloc(discServiceCount_ * sizeof(hal_ble_svc_t));
    CHECK_TRUE(services, SYSTEM_ERROR_NO_MEMORY);
    DiscoveredService* discService = nullptr;
    size_t i = 0;
    do {
        discService = discServicesList_.popFront();
        if (discService) {
            memcpy(services + i, &discService->service, sizeof(hal_ble_svc_t));
            i++;
            DiscoveredService* curr = discService;
            gattcDiscPool_.free(curr);
        }
    } while (discService);
    //LOG_DEBUG(TRACE, "Discovered services address: %u, len: %u", (unsigned)services, discServiceCount_ * sizeof(hal_ble_svc_t));
    BleObject::BleEventDispatcher::EventMessage msg;
    msg.evt.type = BLE_EVT_SVC_DISCOVERED;
    msg.evt.version = BLE_API_VERSION;
    msg.evt.size = sizeof(hal_ble_evts_t);
    msg.evt.params.svc_disc.conn_handle = currDiscConnHandle_;
    msg.evt.params.svc_disc.count = discServiceCount_;
    msg.evt.params.svc_disc.services = services;
    msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)callback;
    msg.context = context;
    msg.hook = gattcEventProcessedHook;
    msg.hookContext = this;
    return BleObject::getInstance().dispatcher()->enqueue(msg);
}

int BleObject::GattClient::discoverCharacteristics(hal_ble_conn_handle_t connHandle, const hal_ble_svc_t* service, hal_ble_on_disc_char_cb_t callback, void* context) {
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    CHECK_FALSE(isDiscovering_, SYSTEM_ERROR_INVALID_STATE);
    SCOPE_GUARD ({
        resetDiscoveryState();
    });
    currDiscSvc_ = *service;
    currDiscConnHandle_ = connHandle;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS;
    ble_gattc_handle_range_t handleRange = {};
    handleRange.start_handle = service->start_handle;
    handleRange.end_handle = service->end_handle;
    int ret = sd_ble_gattc_characteristics_discover(connHandle, &handleRange);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isDiscovering_ = true;
    if (os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    // Now discover characteristic descriptors
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS;
    ret = sd_ble_gattc_descriptors_discover(currDiscConnHandle_, &handleRange);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isDiscovering_ = true;
    if (os_semaphore_take(discoverySemaphore_, BLE_DICOVERY_PROCEDURE_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    hal_ble_char_t* characteristics = (hal_ble_char_t*)malloc(discCharacteristicCount_ * sizeof(hal_ble_char_t));
    CHECK_TRUE(characteristics, SYSTEM_ERROR_NO_MEMORY);
    DiscoveredCharacteristic* discChar = nullptr;
    size_t i = 0;
    do {
        discChar = discCharacteristicsList_.popFront();
        if (discChar) {
            memcpy(characteristics + i, &discChar->characteristic, sizeof(hal_ble_char_t));
            i++;
            DiscoveredCharacteristic* curr = discChar;
            gattcDiscPool_.free(curr);
        }
    } while (discChar);
    //LOG_DEBUG(TRACE, "Discovered characteristics address: %u, len: %u", (unsigned)characteristics, discCharacteristicCount_ * sizeof(hal_ble_char_t));
    BleObject::BleEventDispatcher::EventMessage msg;
    msg.evt.type = BLE_EVT_CHAR_DISCOVERED;
    msg.evt.version = BLE_API_VERSION;
    msg.evt.size = sizeof(hal_ble_evts_t);
    msg.evt.params.char_disc.conn_handle = currDiscConnHandle_;
    msg.evt.params.char_disc.count = discCharacteristicCount_;
    msg.evt.params.char_disc.characteristics = characteristics;
    msg.handler = (BleObject::BleEventDispatcher::BleSpecificEventHandler)callback;
    msg.context = context;
    msg.hook = gattcEventProcessedHook;
    msg.hookContext = this;
    return BleObject::getInstance().dispatcher()->enqueue(msg);
}

ssize_t BleObject::GattClient::writeAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len, bool response) {
    CHECK_TRUE(buf, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(len, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    SCOPE_GUARD ({
        currWriteConnHandle_ = BLE_INVALID_CONN_HANDLE;
    });
    ble_gattc_write_params_t writeParams = {};
    if (response) {
        writeParams.write_op = BLE_GATT_OP_WRITE_REQ;
    } else {
        writeParams.write_op = BLE_GATT_OP_WRITE_CMD;
    }
    len = std::min(len, (size_t)BLE_ATTR_VALUE_PACKET_SIZE(BleObject::getInstance().connMgr()->getAttMtu(connHandle)));
    writeParams.flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    writeParams.handle = attrHandle;
    writeParams.offset = 0;
    writeParams.len = len;
    writeParams.p_value = buf;
    int ret = sd_ble_gattc_write(connHandle, &writeParams);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isWriting_ = true;
    currWriteConnHandle_ = connHandle;
    if (os_semaphore_take(writeSemaphore_, BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return len;
}

// FIXME: Multi-link read
ssize_t BleObject::GattClient::readAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len) {
    CHECK_TRUE(buf, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(len, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    SCOPE_GUARD ({
        isReading_ = false;
        readBuf_ = nullptr;
        readAttrHandle_ = BLE_INVALID_ATTR_HANDLE;
        currReadConnHandle_ = BLE_INVALID_CONN_HANDLE;
    });
    readAttrHandle_ = attrHandle;
    readBuf_ = buf;
    readLen_ = std::min(len, (size_t)BLE_ATTR_VALUE_PACKET_SIZE(BleObject::getInstance().connMgr()->getAttMtu(connHandle)));
    int ret = sd_ble_gattc_read(connHandle, attrHandle, 0);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isReading_ = true;
    currReadConnHandle_ = connHandle;
    if (os_semaphore_take(readSemaphore_, BLE_READ_WRITE_PROCEDURE_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return readLen_;
}

void BleObject::GattClient::resetDiscoveryState() {
    discoverAll_ = false;
    isDiscovering_ = false;
    currDiscConnHandle_ = BLE_INVALID_CONN_HANDLE;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_IDLE;
    discServiceCount_ = 0;
    discCharacteristicCount_ = 0;
    DiscoveredService* discService = nullptr;
    DiscoveredCharacteristic* discChar = nullptr;
    do {
        discService = discServicesList_.popFront();
        if (discService) {
            DiscoveredService* curr = discService;
            gattcDiscPool_.free(curr);
        }
    } while (discService);
    do {
        discChar = discCharacteristicsList_.popFront();
        if (discChar) {
            DiscoveredCharacteristic* curr = discChar;
            gattcDiscPool_.free(curr);
        }
    } while (discChar);
}

int BleObject::GattClient::addDiscoveredService(const hal_ble_svc_t& service) {
    DiscoveredService* discService = (DiscoveredService*)gattcDiscPool_.alloc(sizeof(DiscoveredService));
    CHECK_TRUE(discService, SYSTEM_ERROR_NO_MEMORY);
    discService->service = service;
    discServicesList_.pushFront(discService);
    discServiceCount_++;
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::addDiscoveredCharacteristic(const hal_ble_char_t& characteristic) {
    DiscoveredCharacteristic* discChar = (DiscoveredCharacteristic*)gattcDiscPool_.alloc(sizeof(DiscoveredCharacteristic));
    CHECK_TRUE(discChar, SYSTEM_ERROR_NO_MEMORY);
    discChar->characteristic = characteristic;
    discCharacteristicsList_.pushFront(discChar);
    discCharacteristicCount_++;
    return SYSTEM_ERROR_NONE;
}

bool BleObject::GattClient::readServiceUUID128IfNeeded() const {
    auto discService = discServicesList_.front();
    while (discService) {
        if (discService->service.uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
            return (sd_ble_gattc_read(currDiscConnHandle_, discService->service.start_handle, 0) == NRF_SUCCESS);
        }
        discService = discService->next;
    }
    return false;
}

