particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
bool BleObject::GattClient::readCharacteristicUUID128IfNeeded() const {
    auto discChar = discCharacteristicsList_.front();
    while (discChar) {
        if (discChar->characteristic.uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
            return (sd_ble_gattc_read(currDiscConnHandle_, discChar->characteristic.charHandles.decl_handle, 0) == NRF_SUCCESS);
        }
        discChar = discChar->next;
    }
    return false;
}

hal_ble_svc_t* BleObject::GattClient::findDiscoveredService(hal_ble_attr_handle_t attrHandle) {
    auto discService = discServicesList_.front();
    while (discService) {
        if (discService->service.start_handle <= attrHandle && attrHandle <= discService->service.end_handle) {
            return &discService->service;
        }
        discService = discService->next;
    }
    return nullptr;
}

hal_ble_char_t* BleObject::GattClient::findDiscoveredCharacteristic(hal_ble_attr_handle_t attrHandle) {
    hal_ble_char_t* foundChar = nullptr;
    hal_ble_attr_handle_t foundCharDeclHandle = BLE_INVALID_ATTR_HANDLE;
    auto discChar = discCharacteristicsList_.front();
    while (discChar) {
        // The attribute handles increase by sequence.
        if (attrHandle >= discChar->characteristic.charHandles.decl_handle) {
            if (discChar->characteristic.charHandles.decl_handle > foundCharDeclHandle) {
                foundChar = &discChar->characteristic;
                foundCharDeclHandle = discChar->characteristic.charHandles.decl_handle;
            }
        }
        discChar = discChar->next;
    }
    return foundChar;
}

void BleObject::GattClient::gattcEventProcessedHook(const hal_ble_evts_t *event, void* context) {
    GattClient* gattc = static_cast<GattClient*>(context);
    if (gattc && event) {
        if (event->type == BLE_EVT_SVC_DISCOVERED) {
            if (event->params.svc_disc.services != nullptr) {
                free(event->params.svc_disc.services);
                //LOG_DEBUG(TRACE, "Free discovered services memory: %u", (unsigned)event->params.svc_disc.services);
            }
        }
        if (event->type == BLE_EVT_CHAR_DISCOVERED) {
            if (event->params.char_disc.characteristics != nullptr) {
                free(event->params.char_disc.characteristics);
                //LOG_DEBUG(TRACE, "Free discovered characteristics memory: %u", (unsigned)event->params.char_disc.characteristics);
            }
        }
        if (event->type == BLE_EVT_DATA_NOTIFIED) {
            if (event->params.data_rec.data != nullptr) {
                gattc->gattcDataRecPool_.free(event->params.data_rec.data);
                //LOG_DEBUG(TRACE, "Free received data memory: %u", (unsigned)event->params.data_rec.data);
            }
        }
    }
}

void BleObject::GattClient::processGattClientEvents(const ble_evt_t* event, void* context) {
    GattClient* gattc = static_cast<GattClientImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_DISCONNECTED: {
            if (gattc->isDiscovering_ && event->evt.gap_evt.conn_handle == gattc->currDiscConnHandle_) {
                gattc->isDiscovering_ = false;
                os_semaphore_give(gattc->discoverySemaphore_, false);
            }
            break;
        }
        case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: {
            const ble_gattc_evt_prim_srvc_disc_rsp_t& primSvcDiscRsp = event->evt.gattc_evt.params.prim_srvc_disc_rsp;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d primary service discovered.", primSvcDiscRsp.count);
            if (!gattc->isDiscovering_ || gattc->currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_SERVICES ||
                    event->evt.gattc_evt.conn_handle != gattc->currDiscConnHandle_) {
                return;
            }
            if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                for (uint8_t i = 0; i < primSvcDiscRsp.count; i++) {
                    hal_ble_svc_t service = {};
                    service.version = BLE_API_VERSION;
                    service.size = sizeof(hal_ble_svc_t);
                    service.start_handle = primSvcDiscRsp.services[i].handle_range.start_handle;
                    service.end_handle = primSvcDiscRsp.services[i].handle_range.end_handle;
                    BleObject::toHalUUID(&primSvcDiscRsp.services[i].uuid, &service.uuid);
                    if (gattc->addDiscoveredService(service) != SYSTEM_ERROR_NONE) {
                        break;
                    }
                }
                hal_ble_attr_handle_t currEndHandle = primSvcDiscRsp.services[primSvcDiscRsp.count - 1].handle_range.end_handle;
                if ((gattc->discoverAll_) && (currEndHandle < SERVICES_TOP_END_HANDLE)) {
                    int ret = sd_ble_gattc_primary_services_discover(gattc->currDiscConnHandle_, currEndHandle + 1, nullptr);
                    if (ret == NRF_SUCCESS) {
                        return;
                    }
                    LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed: %u", (unsigned)ret);
                    // Falls down to read 128-bits UUID if needed.
                }
            } else {
                LOG(ERROR, "BLE service discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
                // Falls down to read 128-bits UUID if needed.
            }
            if (gattc->readServiceUUID128IfNeeded()) {
                return;
            }
            gattc->isDiscovering_ = false;
            os_semaphore_give(gattc->discoverySemaphore_, false);
            break;
        }
        case BLE_GATTC_EVT_CHAR_DISC_RSP: {
            const ble_gattc_evt_char_disc_rsp_t& charDiscRsp = event->evt.gattc_evt.params.char_disc_rsp;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d characteristic discovered.", charDiscRsp.count);
            if (!gattc->isDiscovering_ || gattc->currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS ||
                    event->evt.gattc_evt.conn_handle != gattc->currDiscConnHandle_) {
                return;
            }
            if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                for (uint8_t i = 0; i < charDiscRsp.count; i++) {
                    hal_ble_char_t characteristic = {};
                    characteristic.version = BLE_API_VERSION;
                    characteristic.size = sizeof(hal_ble_char_t);
                    characteristic.char_ext_props = charDiscRsp.chars[i].char_ext_props;
                    characteristic.properties = toHalCharProps(charDiscRsp.chars[i].char_props);
                    characteristic.charHandles.version = BLE_API_VERSION;
                    characteristic.charHandles.size = sizeof(hal_ble_char_handles_t);
                    characteristic.charHandles.decl_handle = charDiscRsp.chars[i].handle_decl;
                    characteristic.charHandles.value_handle = charDiscRsp.chars[i].handle_value;
                    BleObject::toHalUUID(&charDiscRsp.chars[i].uuid, &characteristic.uuid);
                    if (gattc->addDiscoveredCharacteristic(characteristic) != SYSTEM_ERROR_NONE) {
                        break;
                    }
                }
                hal_ble_attr_handle_t currEndHandle = charDiscRsp.chars[charDiscRsp.count - 1].handle_value;
                if (currEndHandle < gattc->currDiscSvc_.end_handle) {
                    ble_gattc_handle_range_t handleRange = {};
                    handleRange.start_handle = currEndHandle + 1;
                    handleRange.end_handle = gattc->currDiscSvc_.end_handle;
                    int ret = sd_ble_gattc_characteristics_discover(gattc->currDiscConnHandle_, &handleRange);
                    if (ret == NRF_SUCCESS) {
                        return;
                    }
                    LOG(ERROR, "sd_ble_gattc_characteristics_discover() failed: %u", (unsigned)ret);
                    // Falls down to read 128-bits UUID if needed.
                }
            } else {
                LOG(ERROR, "BLE characteristic discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
                // Falls down to read 128-bits UUID if needed.
            }
            if (gattc->readCharacteristicUUID128IfNeeded()) {
                return;
            }
            gattc->isDiscovering_ = false;
            os_semaphore_give(gattc->discoverySemaphore_, false);
            break;
        }
        case BLE_GATTC_EVT_DESC_DISC_RSP: {
            const ble_gattc_evt_desc_disc_rsp_t& descDiscRsp = event->evt.gattc_evt.params.desc_disc_rsp;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d descriptors discovered.", descDiscRsp.count);
            if (!gattc->isDiscovering_ || gattc->currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS ||
                    event->evt.gattc_evt.conn_handle != gattc->currDiscConnHandle_) {
                return;
            }
            if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                for (uint8_t i = 0; i < descDiscRsp.count; i++) {
                    // It will report all attributes with 16-bits UUID, filter descriptors.
                    hal_ble_char_t* characteristic = gattc->findDiscoveredCharacteristic(descDiscRsp.descs[i].handle);
                    if (characteristic) {
                        switch (descDiscRsp.descs[i].uuid.uuid) {
                            case BLE_SIG_UUID_CHAR_USER_DESCRIPTION_DESC: {
                                characteristic->charHandles.user_desc_handle = descDiscRsp.descs[i].handle;
                            } break;
                            case BLE_SIG_UUID_CLIENT_CHAR_CONFIG_DESC: {
                                characteristic->charHandles.cccd_handle = descDiscRsp.descs[i].handle;
                            } break;
                            case BLE_SIG_UUID_SERVER_CHAR_CONFIG_DESC: {
                                characteristic->charHandles.sccd_handle = descDiscRsp.descs[i].handle;
                            } break;
                            case BLE_SIG_UUID_CHAR_EXTENDED_PROPERTIES_DESC:
                            case BLE_SIG_UUID_CHAR_PRESENT_FORMAT_DESC:
                            case BLE_SIG_UUID_CHAR_AGGREGATE_FORMAT:
                            default: break;
                        }
                    }
                }
                hal_ble_attr_handle_t currEndHandle = descDiscRsp.descs[descDiscRsp.count - 1].handle;
                if (currEndHandle < gattc->currDiscSvc_.end_handle) {
                    ble_gattc_handle_range_t handleRange = {};
                    handleRange.start_handle = currEndHandle + 1;
                    handleRange.end_handle = gattc->currDiscSvc_.end_handle;
                    int ret = sd_ble_gattc_descriptors_discover(gattc->currDiscConnHandle_, &handleRange);
                    if (ret == NRF_SUCCESS) {
                        return;
                    }
                    LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed: %u", (unsigned)ret);
                    // Falls down to finish the discovery procedure.
                }
            }
            gattc->isDiscovering_ = false;
            os_semaphore_give(gattc->discoverySemaphore_, false);
            break;
        }
        case BLE_GATTC_EVT_READ_RSP: {
            const ble_gattc_evt_read_rsp_t& readRsp = event->evt.gattc_evt.params.read_rsp;
            LOG_DEBUG(TRACE, "BLE GATT Client event: read response.");
            // If this event is responding to the read 128-bits UUID command.
            if (gattc->isDiscovering_ && event->evt.gattc_evt.conn_handle == gattc->currDiscConnHandle_) {
                if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                    if (gattc->currDiscProcedure_ == DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_SERVICES) {
                        hal_ble_svc_t* service = gattc->findDiscoveredService(readRsp.handle);
                        if (service) {
                            service->uuid.type = BLE_UUID_TYPE_128BIT;
                            memcpy(service->uuid.uuid128, readRsp.data, BLE_SIG_UUID_128BIT_LEN);
                            if (gattc->readServiceUUID128IfNeeded()) {
                                return;
                            }
                        }
                    } else if (gattc->currDiscProcedure_ == DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS) {
                        hal_ble_char_t* characteristic = gattc->findDiscoveredCharacteristic(readRsp.handle);
                        if (characteristic) {
                            characteristic->uuid.type = BLE_UUID_TYPE_128BIT;
                            memcpy(characteristic->uuid.uuid128, &readRsp.data[3], BLE_SIG_UUID_128BIT_LEN);
                            if (gattc->readCharacteristicUUID128IfNeeded()) {
                                return;
                            }
                        }
                    }
                } else {
                    LOG(ERROR, "BLE read characteristic failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
                }
                gattc->isDiscovering_ = false;
                os_semaphore_give(gattc->discoverySemaphore_, false);
                return;
            }
            // Otherwise, this event is responding to the read command.
            if (gattc->isReading_ && gattc->currReadConnHandle_ == event->evt.gattc_evt.conn_handle) {
                if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                    if (gattc->readAttrHandle_ == readRsp.handle && gattc->readBuf_ != nullptr) {
                        gattc->readLen_ = std::min(gattc->readLen_, (size_t)readRsp.len);
                        memcpy(gattc->readBuf_, readRsp.data, gattc->readLen_);
                    }
                } else {
                    LOG(ERROR, "BLE read characteristic failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
                }
                gattc->isReading_ = false;
                os_semaphore_give(gattc->readSemaphore_, false);
            }
            break;
        }
        case BLE_GATTC_EVT_WRITE_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write with response completed.");
            if (gattc->isWriting_ && gattc->currWriteConnHandle_ == event->evt.gattc_evt.conn_handle) {
                gattc->isWriting_ = false;
                os_semaphore_give(gattc->writeSemaphore_, false);
            }
            break;
        }
        case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write without response completed.");
            if (gattc->isWriting_ && gattc->currWriteConnHandle_ == event->evt.gattc_evt.conn_handle) {
                gattc->isWriting_ = false;
                os_semaphore_give(gattc->writeSemaphore_, false);
            }
            break;
        }
        case BLE_GATTC_EVT_HVX: {
            const ble_gattc_evt_hvx_t& hvx = event->evt.gattc_evt.params.hvx;
            LOG_DEBUG(TRACE, "BLE GATT Client event: data received. conn_handle: %d, attr_handle: %d, type: %d",
                    event->evt.gattc_evt.conn_handle, hvx.handle, hvx.type);
            if (hvx.type == BLE_GATT_HVX_INDICATION) {
                int ret = sd_ble_gattc_hv_confirm(event->evt.gattc_evt.conn_handle, hvx.handle);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gattc_hv_confirm() failed: %u", (unsigned)ret);
                    return;
                }
            }
            uint8_t* data = (uint8_t*)gattc->gattcDataRecPool_.alloc(hvx.len);
            if (!data) {
                LOG(ERROR, "Allocate memory for received data failed.");
                return;
            }
            LOG_DEBUG(TRACE, "Received data address: %u, len: %u", (unsigned)data, hvx.len);
            BleObject::BleEventDispatcher::EventMessage msg;
            msg.evt.type = BLE_EVT_DATA_NOTIFIED;
            msg.evt.version = BLE_API_VERSION;
            msg.evt.size = sizeof(hal_ble_evts_t);
            msg.evt.params.data_rec.conn_handle = event->evt.gattc_evt.conn_handle;
            msg.evt.params.data_rec.attr_handle = hvx.handle;
            msg.evt.params.data_rec.offset = 0;
            msg.evt.params.data_rec.data_len = hvx.len;
            memcpy(data, hvx.data, hvx.len);
            msg.evt.params.data_rec.data = data;
            msg.hook = gattc->gattcEventProcessedHook;
            msg.hookContext = gattc;
            BleObject::getInstance().dispatcher()->enqueue(msg);
            break;
        }
        case BLE_GATTC_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: timeout, conn handle: %d, source: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.timeout.src);
            // Disconnect on GATT Client timeout event.
            int ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
            if (gattc->isReading_ && gattc->currReadConnHandle_ == event->evt.gattc_evt.conn_handle) {
                gattc->isReading_ = false;
                os_semaphore_give(gattc->readSemaphore_, false);
            }
            if (gattc->isWriting_ && gattc->currWriteConnHandle_ == event->evt.gattc_evt.conn_handle) {
                gattc->isWriting_ = false;
                os_semaphore_give(gattc->writeSemaphore_, false);
            }
            break;
        }
        default: {
            break;
        }
    }
}

bool BleObject::initialized_ = false;

BleObject& BleObject::getInstance() {
    static BleObject instance;
    return instance;
}

int BleObject::init() {
    if (initialized_) {
        return SYSTEM_ERROR_NONE;
    }
    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t appRamStart = 0;
    int ret = nrf_sdh_ble_default_cfg_set(BLE_CONN_CFG_TAG, &appRamStart);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    LOG_DEBUG(TRACE, "APP RAM start: 0x%08x", (unsigned)appRamStart);
    // Enable the stack
    uint32_t sdRamEnd = appRamStart;
    ret = nrf_sdh_ble_enable(&sdRamEnd);
    LOG_DEBUG(TRACE, "SoftDevice RAM end: 0x%08x", (unsigned)sdRamEnd);
    if (sdRamEnd >= appRamStart) {
        LOG(ERROR, "Need to change APP_RAM_BASE in linker script to be large than: 0x%08x", (unsigned)sdRamEnd - 0x20000000);
    }
    SPARK_ASSERT(sdRamEnd < appRamStart);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    /*
     * NOTE: Once the following initializations are successful, the pointers are associated with SoftDevice
     * event handler. Thus we cannot destroy these pointers, unless the whole BLE stack is disabled, which
     * will also disable the mesh functionality temporarily.
     */
    if (!dispatcher_) {
        dispatcher_.reset(new(std::nothrow) BleEventDispatcher());
        CHECK_TRUE(dispatcher_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!dispatcher_->initialized()) {
        CHECK(dispatcher_->init());
    }
    if (!gap_) {
        gap_.reset(new(std::nothrow) BleGap());
        CHECK_TRUE(gap_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!gap_->initialized()) {
        CHECK(gap_->init());
    }
    if (!broadcaster_) {
        broadcaster_.reset(new(std::nothrow) Broadcaster());
        CHECK_TRUE(broadcaster_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!broadcaster_->initialized()) {
        CHECK(broadcaster_->init());
    }
    if (!observer_) {
        observer_.reset(new(std::nothrow) Observer());
        CHECK_TRUE(observer_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!observer_->initialized()) {
        CHECK(observer_->init());
    }
    if (!connectionsMgr_) {
        connectionsMgr_.reset(new(std::nothrow) ConnectionsManager());
        CHECK_TRUE(connectionsMgr_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!connectionsMgr_->initialized()) {
        CHECK(connectionsMgr_->init());
    }
    if (!gatts_) {
        gatts_.reset(new(std::nothrow) GattServer());
        CHECK_TRUE(gatts_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!gatts_->initialized()) {
        CHECK(gatts_->init());
    }
    if (!gattc_) {
        gattc_.reset(new(std::nothrow) GattClient());
        CHECK_TRUE(gattc_, SYSTEM_ERROR_NO_MEMORY);
    }
    if (!gattc_->initialized()) {
        CHECK(gattc_->init());
    }
    initialized_ = true;
    return SYSTEM_ERROR_NONE;
}

bool BleObject::initialized() const {
    return initialized_;
}

